spec/cassettes/StripeWrapper_Charge/with_invalid_card/set_a_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=11&card[exp_year]=2016&card[cvc]=123
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.9
      Authorization:
      - Bearer sk_test_oMlhXvNQok7zm1EtNzAhkaAJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.9","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        CHANGYIs-MacBook-Air.local 12.5.0 Darwin Kernel Version 12.5.0: Mon Jul 29
        16:33:49 PDT 2013; root:xnu-2050.48.11~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 28 Nov 2013 07:03:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1031Rj2zh8gd9Tol7oqLtDuf",
          "livemode": false,
          "created": 1385622236,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_1031Rj2zh8gd9TolvgJ1QKZB",
            "object": "card",
            "last4": "0002",
            "type": "Visa",
            "exp_month": 11,
            "exp_year": 2016,
            "fingerprint": "8FeEHrslouH2imED",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Thu, 28 Nov 2013 07:03:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_1031Rj2zh8gd9Tol7oqLtDuf&description=Sign%20up%20charge%20for%3A%20test_mode%40example.com
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.9
      Authorization:
      - Bearer sk_test_oMlhXvNQok7zm1EtNzAhkaAJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.9","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        CHANGYIs-MacBook-Air.local 12.5.0 Darwin Kernel Version 12.5.0: Mon Jul 29
        16:33:49 PDT 2013; root:xnu-2050.48.11~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '123'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Thu, 28 Nov 2013 07:03:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_1031Rj2zh8gd9TolPH0aDA9Z"
          }
        }
    http_version: 
  recorded_at: Thu, 28 Nov 2013 07:03:57 GMT
recorded_with: VCR 2.8.0
